org/First_Post.org
# -*- org-export-babel-evaluate: nil -*-
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: posts

#+TITLE: First Blog Post

#+AUTHOR: Nikola Stoyanov
#+EMAIL: nikst@posteo.net
#+DATE: <2018-02-21 Web>

#+HUGO_TAGS: meta
#+HUGO_CATEGORIES: meta
#+HUGO_DRAFT: false
#+HUGO_DESCRIPTION: This is my first blog post!

#+STARTUP: showall
#+STARTUP: showstars
#+STARTUP: inlineimages

* Hi
I have just finished building this blog from [[https://www.gnu.org/software/emacs/][Emacs]] and [[https://orgmode.org/][Org Mode]]. My
intention is to blog about my work during my PhD and since I do almost
all of my report writing work in [[https://orgmode.org/][Org Mode]] I needed a system with which
I can upload content quickly and easily.

The website is built using the script detailed in the [[https://ogbe.net/blog/blogging_with_org.html][blog]] of Dennis
Ogbe using nothing else but the built-in functionality of Org Mode and
some elisp.

We can test some functionality to make sure everything is working as
expected. Let's say hello properly!

#+BEGIN_SRC python :results output drawer :exports both
def say_hi(msg):
    print(msg)

say_hi("Welcome to my blog!")
#+END_SRC

#+RESULTS:
:RESULTS:
Welcome to my blog!
:END:
