content/posts/First_Post.md
+++
title = "First Blog Post"
author = ["Nikola Stoyanov"]
date = 2018-02-21T00:00:00+00:00
tags = ["meta"]
categories = ["meta"]
draft = false
+++

## Hi {#hi}

I have just finished building this blog from [Emacs](https://www.gnu.org/software/emacs/) and [Org Mode](https://orgmode.org/). My
intention is to blog about my work during my PhD and since I do almost
all of my report writing work in [Org Mode](https://orgmode.org/) I needed a system with which
I can upload content quickly and easily.

The website is built using the script detailed in the [blog](https://ogbe.net/blog/blogging%5Fwith%5Forg.html) of Dennis
Ogbe using nothing else but the built-in functionality of Org Mode and
some elisp.

We can test some functionality to make sure everything is working as
expected. Let's say hello properly!

```python
def say_hi(msg):
    print(msg)

say_hi("Welcome to my blog!")
```

Welcome to my blog!